garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
         schemaVersion="1.3"
         xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd"
         xs:noNamespaceSchemaLocation="PACK.ATMEL.xsd">
   <vendor>Microchip</vendor>
   <url>https://packs.download.microchip.com/</url>
   <name>PIC18F-Q_DFP</name>
   <description>Microchip PIC18F-Q Series Device Support</description>
   <releases>
      <release version="1.28.451" date="2025-03-24">
        - Corrected irq values for Interrupts for PIC18FxxQ40/41.
      </release>
      <release version="1.27.449" date="2025-02-04">
        - Updated programming and debugging support scripts for PIC18F57Q43.
        - Corrected APMSTATUS access bits for PIC18FxxQ71 devices.
        - Corrected remappable pin definitions for SRPORT for PIC18F56Q71.
        - Added missing WPU, I2CxBAUD and I2CxBTOC registers for I/O View for PIC18F57Q84.
      </release>
      <release version="1.26.442" date="2024-11-25">
        - Added programming and debugging support scripts.
      </release>
      <release version="1.25.433" date="2024-02-23">
        - Added PIC18F04Q20, PIC18F05Q20, PIC18F14Q20, and PIC18F15Q20.
        - Added BERRDET bit to I3CxCON1 register for I3C module for PIC18F06Q20 and PIC18F16Q20.
      </release>
      <release version="1.24.430" date="2023-12-18">
        - Fixed mismatch in PPS setting name for SRPORT in PIC18F-Q24 devices.
        - Corrected CLCSELECT register SLCT bits.
        - Added missing freeze peripheral information for PIC18F24Q10 and PIC18F25Q10.
        - Updated PIC18F-Q24 devices to match datasheet.
        - Corrected SAF enable message when SAF is disabled.
      </release>
      <release version="1.23.425" date="2023-10-17">
        - Added support for PIC18F56Q24 Curiosity Nano.
        - Added support for PIC18F16Q20 Curiosity Nano.
        - Fixed SRPORT names in PIC18FxxQ24.
      </release>
      <release version="1.22.413" date="2023-09-18">
        - Fixed device ID for PIC18F24Q24.
        - Fixed RC5 and RC6 pin names for PIC18FxxQ24 devices.
        - Enabled high voltage programming on PIC18FxxQ24 devices.
      </release>
      <release version="1.21.411" date="2023-08-17">
        - Updated CnTXQCONL register on PIC18FxxQ24 devices.
        - Added more field definitions for BBSIZE.
        - Renamed config bit value SAFSZ_NONE to SAFSZ_DIS to match datasheet.
        - Updated VDDIOnCON register to match datasheet.
        - Updated all PORT F pins to be selectable in ADC module by adding CGF3-CGF7 to ADCG1F.
        - Fixed type and width of SPBRG register.
      </release>
      <release version="1.20.405" date="2023-07-18">
        - Fixed PIC18FxxQ24 ADC mask values.
        - Updated TMRx bits to match datasheet.
        - Fixed some PIC18FxxQ24 CONFIG bit descriptions to match datasheet.
        - Fixed BOREN settings for PIC18FxxQ24.
        - Fixed DMA values to match datasheet for PIC18FxxQ24.
        - Fixed CLCnSELX values for PIC18FxxQ24.
        - Fixed I2CxBTOC mask values for PIC18FxxQ24.
        - Fixed MVIO interrupt numbers to match datasheet for PIC18FxxQ24.
      </release>
      <release version="1.19.401" date="2023-06-21">
        - Added 18F24Q24, 18F25Q24, 18F26Q24, 18F45Q24, 18F46Q24,
           18F55Q24, and 18F56Q24.
        - Added missing AVSS pin for PIC18F4xQxx.
        - Added T0OUPTSx bits for PIC18FxxQ43.
        - Fixed STKPTR length for PIC18FxxQ84
        - Fixed PIC18FxxQ84 access and POR values.
        - Updated PIC18FxxQ20 I2C registers.
        - Removed header files that now exist in XC8.
      </release>
      <release version="1.18.389" date="2023-05-24">
        - Corrected POR Value for APMCLKPPS for PIC18FxxQ71.
        - Updates to match datasheets for PIC18FxxQ20/71.
        - Corrected FSRx size for PIC18FxxQ43.
        - Corrected Factory Default bits for PIC18FxxQ83/84.
      </release>
      <release version="1.17.379" date="2023-03-23">
        - Added 18F06Q20 and 18F16Q20.
        - Added 18F44Q71, 18F45Q71, 18F54Q71, and 18F55Q71.
        - Corrected access bits for the BAUDCON register.
        - Corrected CP config bit value for PIC18F24/25Q71 devices.
        - Corrected size of IS bit in the CSGxISM register.
      </release>
      <release version="1.16.368" date="2023-02-09">
        - Added PIC18F24Q71 and PIC18F25Q71.
        - MPLABX-7387 Fixed missing registers displayed in IO view.
        - Added support for reading DIA and DCI on Curiosity Nano.
        - Added read support for Hardware Stack on Curiosity Nano.
        - Added support for Set PC on Curiosity Nano.
        - Added Voltage Parameters on Curiosity Nano.
    </release>
      <release version="1.15.360" date="2022-12-30">
        - UDBC-2041 Fixed write access to TMR0IF and TMR0 interrupt to work with Simulator.
        - XC8-3072 Fixed programming of configuration registers for PIC18R26Q71 and PIC18F56Q084.
    </release>
      <release version="1.14.237" date="2022-06-17">
        - Added PIC18F[2|4|5]6Q71 devices.
        - DSG-4574 added device revision readout for Curiosity Nanos.
        - Updated builk erase VDD from 1.8V to 2.1V for some parts.
        - Fixed row erase sizes.
        - Updated access masks for interrupt registers.
      </release>
      <release version="1.13.211" date="2021-12-08">
        - Updated REAL ICE trace macros.
        - Updated the range of the UserID memory.
        - Updated CWG bitnames.
        - Added access to GPR9.
        - Updated POR and MCLR state of CLKRCON and WDTTMR.
      </release>
      <release version="1.12.193" date="2021-06-04">
        - Added UART3, UART4, UART5, SPI1, SPI2, SPI3, SP4, SPI5, WGM2, and WGM3 to views in MPLAB X for applicable devices.
        - Fixed PPS ports for PIC18F45Q10, PIC18F46Q10, and PIC18F47Q10.
      </release>
      <release version="1.11.185" date="2021-02-10">Added PIC18F-6Q83 and PIC18F-6Q84 devices.</release>
      <release version="1.10.183" date="2021-01-22">Fixed EEPROM address range for PIC18F-Q40 and PIC18F-Q41 devices. Removed HT entries from CCPxCON and ADCON.</release>
      <release version="1.9.175" date="2020-11-19">Enable high voltage programming for PIC18F-Q40 and PIC18F-Q41 devices. Rename DMAnDSAL bits from SSA to DSA.</release>
      <release version="1.8.154" date="2020-08-20">Add PKoB Nano debug scripts for PIC18F16Q40 and PIC18F16Q41. Update GPR.</release>
      <release version="1.7.135" date="2020-06-02">Updated device ID for PIC18F57Q84 and PIC18Fx6Q83/84. Add debug scripts for PIC18F57Q84.</release>
      <release version="1.6.129" date="2020-05-07">Corrected ADCSELx register bits to match the datasheet.</release>
      <release version="1.5.124" date="2020-04-29">Added Q40 and Q41 devices. For Q83 and Q84, fixed size of User ID, fixed size of CLKRCLK.CLK, DACCON.DACNSS, removed reserved bits from CONFIG1, renamed interrupt for universal timer, fixed DAC negative reference mask.</release>
      <release version="1.4.109" date="2020-02-12">Added PIC18F-7Q8n devices. Added XC8 support files. Corrected CRCCON1 access value.</release>
      <release version="1.3.89" date="2019-10-29">Updated device descriptors for PIC18F-Q43 devices. Updated XC8 content.</release>
      <release version="1.2.59" date="2019-07-11">Added PIC18F-Q43 devices. Updated tool scripts for PIC18F47Q10. Updated freeze info for PIC18F26Q10, PIC18F27Q10, PIC18F46Q10 and PIC18F47Q10. Added XC8 content.</release>
      <release version="1.0.47" date="2019-05-03">Lowered lvpthresh value.</release>
      <release version="1.0.40" date="2019-02-14">Initial release.</release>
   </releases>
   <keywords>
      <keyword>Microchip</keyword>
      <keyword>Device Family Package Microchip</keyword>
      <keyword>Device Support</keyword>
      <keyword>PIC18F-Q</keyword>
   </keywords>
   <devices>
      <family Dfamily="PIC18F-Q" Dvendor="Microchip:3">
         <environment name="microchip">
            <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                            schemaVersion="1.0">
               <mchp:prerequisite component="MPLAB X IDE" version="[5.10-"/>
               <mchp:prerequisite component="MPLAB X IPE" version="[5.10-"/>
            </mchp:extension>
         </environment>
         <device Dname="PIC18F04Q20">
            <processor Dcore="18xxxx"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="edc/PIC18F04Q20.PIC"/>
                  <mchp:xc8 name="xc8"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD5.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="hwtools/persfr/pic18.persfr"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.35-"/>
                  <mchp:prerequisite component="MPLAB XC8" version="[2.20-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/en-us/product/PIC18F04Q20"
                  title="Device page for PIC18F04Q20"/>
            <book name="https://www.microchip.com/en-us/product/PIC18F04Q20#Documentation"
                  title="Datasheet"/>
         </device>
